# Statistics from Stock Data

구글, 애플, 아마존의 주식을 분석할 것입니다. 구글은 GOOG.csv 애플은 AAPL.csv 아마존은 AMZN.csv 파일에 주식 정보가 있습니다.

다음 7개의 컬럼이 있습니다

**Date Open High Low Close Adj_Close Volume**

csv 파일을 읽어서 DataFrame 으로 처리할 것입니다.

In [1]:
# 판다스를 임포트 하세요.
import pandas as pd

In [2]:
# GOOG.csv 파일을 판다스로 읽어서 df 로 저장하세요.

In [23]:

# 데이터의 처음 5줄을 화면에 출력하세요.

         Date       Open       High        Low      Close  Adj Close    Volume
0  2004-08-19  49.676899  51.693783  47.669952  49.845802  49.845802  44994500
1  2004-08-20  50.178635  54.187561  49.925285  53.805050  53.805050  23005800
2  2004-08-23  55.017166  56.373344  54.172661  54.346527  54.346527  18393200
3  2004-08-24  55.260582  55.439419  51.450363  52.096165  52.096165  15361800
4  2004-08-25  52.140873  53.651051  51.604362  52.657513  52.657513   9257400

,Date,Open,High,Low,Close,Adj Close,Volume
3308,2017-10-09,980.000000,985.424988,976.109985,977.000000,977.000000,891400
3309,2017-10-10,980.000000,981.570007,966.080017,972.599976,972.599976,968400
3310,2017-10-11,973.719971,990.710022,972.250000,989.250000,989.250000,1693300
3311,2017-10-12,987.450012,994.119995,985.000000,987.830017,987.830017,1262400
3312,2017-10-13,992.000000,997.210022,989.000000,989.679993,989.679993,1157700

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3313 entries, 0 to 3312
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Date       3313 non-null   object
 1   Open       3313 non-null   float64
 2   High       3313 non-null   float64
 3   Low        3313 non-null   float64
 4   Close      3313 non-null   float64
 5   Adj Close  3313 non-null   float64
 6   Volume     3313 non-null   int64
dtypes: float64(5), int64(1), object(1)
memory usage: 181.3+ KB

str

'2004-08-19'

AttributeError: 'str' object has no attribute 'weekday'

         Date       Open       High        Low      Close  Adj Close    Volume
0  2004-08-19  49.676899  51.693783  47.669952  49.845802  49.845802  44994500
1  2004-08-20  50.178635  54.187561  49.925285  53.805050  53.805050  23005800
2  2004-08-23  55.017166  56.373344  54.172661  54.346527  54.346527  18393200

        Date       Open       High        Low      Close  Adj Close    Volume
0 2004-08-19  49.676899  51.693783  47.669952  49.845802  49.845802  44994500
1 2004-08-20  50.178635  54.187561  49.925285  53.805050  53.805050  23005800
2 2004-08-23  55.017166  56.373344  54.172661  54.346527  54.346527  18393200
3 2004-08-24  55.260582  55.439419  51.450363  52.096165  52.096165  15361800
4 2004-08-25  52.140873  53.651051  51.604362  52.657513  52.657513   9257400

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3313 entries, 0 to 3312
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Date       3313 non-null   datetime64[ns]
 1   Open       3313 non-null   float64
 2   High       3313 non-null   float64
 3   Low        3313 non-null   float64
 4   Close      3313 non-null   float64
 5   Adj Close  3313 non-null   float64
 6   Volume     3313 non-null   int64
dtypes: datetime64[ns](1), float64(5), int64(1)
memory usage: 181.3 KB

3

In [ ]:
# 0 월,  1 화 2 수 3 목 4 금 5 토 6일



# To Do

우리는, 각 date 에 해당되는 adj close 값만 관심이 있습니다. 따라서 컬럼은 두개만 사용하며, 이 두개 컬럼의 인덱스는 date로 만듭니다. 

hints:

* Use the `index_col` keyword to indicate which column you want to use as an index. For example `index_col = ['Open']`

* Set the `parse_dates` keyword equal to `True` to convert the Dates into real dates of the form year/month/day

* Use the `usecols` keyword to select which columns you want to load into the DataFrame. For example `usecols = ['Open', 'High']`

Fill in the code below:

In [17]:
# We load the Google stock data into a DataFrame

            Adj Close
Date
2004-08-19  49.845802
2004-08-20  53.805050
2004-08-23  54.346527
2004-08-24  52.096165
2004-08-25  52.657513

In [19]:
# We load the Apple stock data into a DataFrame

            Adj Close
Date
2000-01-03   3.596616
2000-01-04   3.293384
2000-01-05   3.341579
2000-01-06   3.052405
2000-01-07   3.196992

In [21]:
# We load the Amazon stock data into a DataFrame

            Adj Close
Date
2000-01-03    89.3750
2000-01-04    81.9375
2000-01-05    69.7500
2000-01-06    65.5625
2000-01-07    69.5625

`2000-01-01`  부터  `2016-12-31`년 까지의 데이터를 처리할것인데  `pd.date_range()` 함수를 이용해서 dates 변수를 만드세요. 그리고 나서 위의  dates 를 인덱스로 하여, 새로 all_stocks 란 데이터프레임을 만드세요

In [39]:
# We create calendar dates between '2000-01-01' and  '2016-12-31'

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07', '2000-01-08',
               '2000-01-09', '2000-01-10',
               ...
               '2016-12-22', '2016-12-23', '2016-12-24', '2016-12-25',
               '2016-12-26', '2016-12-27', '2016-12-28', '2016-12-29',
               '2016-12-30', '2016-12-31'],
              dtype='datetime64[ns]', length=6210, freq='D')

In [41]:
# We create and empty DataFrame that uses the above dates as indices

Empty DataFrame
Columns: []
Index: [2000-01-01 00:00:00, 2000-01-02 00:00:00, 2000-01-03 00:00:00, 2000-01-04 00:00:00, 2000-01-05 00:00:00, 2000-01-06 00:00:00, 2000-01-07 00:00:00, 2000-01-08 00:00:00, 2000-01-09 00:00:00, 2000-01-10 00:00:00, 2000-01-11 00:00:00, 2000-01-12 00:00:00, 2000-01-13 00:00:00, 2000-01-14 00:00:00, 2000-01-15 00:00:00, 2000-01-16 00:00:00, 2000-01-17 00:00:00, 2000-01-18 00:00:00, 2000-01-19 00:00:00, 2000-01-20 00:00:00, 2000-01-21 00:00:00, 2000-01-22 00:00:00, 2000-01-23 00:00:00, 2000-01-24 00:00:00, 2000-01-25 00:00:00, 2000-01-26 00:00:00, 2000-01-27 00:00:00, 2000-01-28 00:00:00, 2000-01-29 00:00:00, 2000-01-30 00:00:00, 2000-01-31 00:00:00, 2000-02-01 00:00:00, 2000-02-02 00:00:00, 2000-02-03 00:00:00, 2000-02-04 00:00:00, 2000-02-05 00:00:00, 2000-02-06 00:00:00, 2000-02-07 00:00:00, 2000-02-08 00:00:00, 2000-02-09 00:00:00, 2000-02-10 00:00:00, 2000-02-11 00:00:00, 2000-02-12 00:00:00, 2000-02-13 00:00:00, 2000-02-14 00:00:00, 2000-02-15 00:00:00, 2000-02-16 00:00:00, 2000-02-17 00:00:00, 2000-02-18 00:00:00, 2000-02-19 00:00:00, 2000-02-20 00:00:00, 2000-02-21 00:00:00, 2000-02-22 00:00:00, 2000-02-23 00:00:00, 2000-02-24 00:00:00, 2000-02-25 00:00:00, 2000-02-26 00:00:00, 2000-02-27 00:00:00, 2000-02-28 00:00:00, 2000-02-29 00:00:00, 2000-03-01 00:00:00, 2000-03-02 00:00:00, 2000-03-03 00:00:00, 2000-03-04 00:00:00, 2000-03-05 00:00:00, 2000-03-06 00:00:00, 2000-03-07 00:00:00, 2000-03-08 00:00:00, 2000-03-09 00:00:00, 2000-03-10 00:00:00, 2000-03-11 00:00:00, 2000-03-12 00:00:00, 2000-03-13 00:00:00, 2000-03-14 00:00:00, 2000-03-15 00:00:00, 2000-03-16 00:00:00, 2000-03-17 00:00:00, 2000-03-18 00:00:00, 2000-03-19 00:00:00, 2000-03-20 00:00:00, 2000-03-21 00:00:00, 2000-03-22 00:00:00, 2000-03-23 00:00:00, 2000-03-24 00:00:00, 2000-03-25 00:00:00, 2000-03-26 00:00:00, 2000-03-27 00:00:00, 2000-03-28 00:00:00, 2000-03-29 00:00:00, 2000-03-30 00:00:00, 2000-03-31 00:00:00, 2000-04-01 00:00:00, 2000-04-02 00:00:00, 2000-04-03 00:00:00, 2000-04-04 00:00:00, 2000-04-05 00:00:00, 2000-04-06 00:00:00, 2000-04-07 00:00:00, 2000-04-08 00:00:00, 2000-04-09 00:00:00, ...]

[6210 rows x 0 columns]

            Adj Close
Date
2004-08-19  49.845802
2004-08-20  53.805050

            Adj Close
Date
2000-01-03    89.3750
2000-01-04    81.9375

# To Do

각 `google_stock`, `apple_stock`, `amazon_stock`, 을,  `all_stocks` 의 날짜에 매칭하여 수정종가를 나오게 하기 위해, all_stocks와 각각의 데이터프레임을 join 할 것입니다. 그러나 일단은 먼저, 현재의 구글,애플, 아마존의 DataFrame에 있는 컬럼명을, 각각의 수정종가로 표현하기 위해, 각각의 adj close 를 google_stock, apple_stock, amazon_stock 로 바꿔주세요.  `pd.DataFrame.rename()` 함수를 이용하세요.

In [45]:
# Change the Adj Close column label to Google

            google_stock
Date
2004-08-19     49.845802
2004-08-20     53.805050

In [47]:
# Change the Adj Close column label to Apple

In [48]:
# Change the Adj Close column label to Amazon

            amazon_stock
Date
2000-01-03       89.3750
2000-01-04       81.9375
2000-01-05       69.7500

이제 `all_stocks` DataFrame 를 기준으로, 각각의 구글,애플,아마존의 데이터프레임을 합치겠습니다. `dataframe.join()` 함수를 이용하세요. T `dataframe1.join(dataframe2)`  `dataframe1` 을 기준으로 `dataframe2`를 합치는 함수입니다.

In [50]:
# We join the Google stock to all_stocks

            google_stock
2000-01-01           NaN
2000-01-02           NaN
2000-01-03           NaN
2000-01-04           NaN
2000-01-05           NaN
...                  ...
2016-12-27    791.549988
2016-12-28    785.049988
2016-12-29    782.789978
2016-12-30    771.820007
2016-12-31           NaN

[6210 rows x 1 columns]

In [52]:
# We join the Apple stock to all_stocks

            google_stock  apple_stock
2000-01-01           NaN          NaN
2000-01-02           NaN          NaN
2000-01-03           NaN     3.596616
2000-01-04           NaN     3.293384
2000-01-05           NaN     3.341579
...                  ...          ...
2016-12-27    791.549988   115.819054
2016-12-28    785.049988   115.325203
2016-12-29    782.789978   115.295570
2016-12-30    771.820007   114.396751
2016-12-31           NaN          NaN

[6210 rows x 2 columns]

In [54]:
# We join the Amazon stock to all_stocks

 `all_stocks`  를 앞에서 10줄 출력하여 확인하세요.

            google_stock  apple_stock  amazon_stock
2000-01-01           NaN          NaN           NaN
2000-01-02           NaN          NaN           NaN
2000-01-03           NaN     3.596616       89.3750
2000-01-04           NaN     3.293384       81.9375
2000-01-05           NaN     3.341579       69.7500
2000-01-06           NaN     3.052405       65.5625
2000-01-07           NaN     3.196992       69.5625
2000-01-08           NaN          NaN           NaN
2000-01-09           NaN          NaN           NaN
2000-01-10           NaN     3.140763       69.1875

# To Do

해당 날짜에 데이터가 없는 경우도 있을것입니다. 즉, 데이터가 NaN 으로 나오면 해당년도 데이터가 없는것입니다. 그러므로 NaN이 포함되어 있는지 먼저 확인해 봅니다.

In [ ]:
# Check if there are any NaN values in the all_stocks dataframe

google_stock    3095
apple_stock     1933
amazon_stock    1933
dtype: int64

이제 NaN 값을 포함하는 행은 제거합니다.

In [57]:
# Remove any rows that contain NaN values

            google_stock  apple_stock  amazon_stock
2004-08-19     49.845802     1.973460     38.630001
2004-08-20     53.805050     1.979244     39.509998
2004-08-23     54.346527     1.997236     39.450001
2004-08-24     52.096165     2.053144     39.049999
2004-08-25     52.657513     2.123831     40.299999

 `all_stocks`  에 NaN 이 없어졌는지 체크해 보세요.

In [ ]:
# Check if there are any NaN values in the all_stocks dataframe

google_stock    0
apple_stock     0
amazon_stock    0
dtype: int64

 `all_stocks`  를 화면에 출력하세요.

In [ ]:
# We display the all_stocks DataFrame

이제 아래의 통계데이터를 얻어봅시다. 아래를 각각 채워서 실행해 보세요.

In [60]:
# 각 스톡의 평균을 출력하세요

google_stock    347.420229
apple_stock      47.736018
amazon_stock    216.598177
dtype: float64

In [61]:
    
# 각 스톡의 표준편차를 출력하세요.

google_stock    187.671596
apple_stock      37.421555
amazon_stock    199.129792
dtype: float64

In [62]:
# 각 스톡의 correlation을 출력하세요. 상관관계

              google_stock  apple_stock  amazon_stock
google_stock      1.000000     0.900242      0.952444
apple_stock       0.900242     1.000000      0.886321
amazon_stock      0.952444     0.886321      1.000000

In [ ]:
# 2012년부터의 각 주식데이터 평균을 구하시오.